The given parameter requires a string value.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NonStringParameterValue { get; }
  Visual Basic
Public Shared ReadOnly Property NonStringParameterValue As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NonStringParameterValue {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PropertySetElementFailures Class
  Autodesk.Revit.DB Namespace